# Vlookuo

In [1]:
import pandas as pd

In [3]:
data=pd.read_csv(r"C:\Users\Deepak kumar\Downloads\lookupfile.csv")

In [4]:
data

      Country      Sales    Net Sales
0   Argentina   1,592              563
1      Brasil   1,088              397
2     Germany   1,680              753
3      Greece   2,133              923
4       Japan   1,610              579
5     England   1,540              570
6         USA   1,316              428
7   Singapore   1,799              709
8   Australia   1,624              621
9      Canada     726              236
10     France   2,277              966
11      India     714              221

In [5]:
data[data["Country"]=="Brasil"]

  Country      Sales    Net Sales
1  Brasil   1,088              397

In [7]:
data[data["Country"]=="Brasil"][" Net Sales "]

1    397
Name:  Net Sales , dtype: int64

In [9]:
list(data[data["Country"]=="Brasil"][" Net Sales "])[0]

397

# hlookup

In [10]:
data

      Country      Sales    Net Sales
0   Argentina   1,592              563
1      Brasil   1,088              397
2     Germany   1,680              753
3      Greece   2,133              923
4       Japan   1,610              579
5     England   1,540              570
6         USA   1,316              428
7   Singapore   1,799              709
8   Australia   1,624              621
9      Canada     726              236
10     France   2,277              966
11      India     714              221

In [15]:
data=data.T

In [16]:
data

,0,1,2,3,4,5,6,7,8,9,10,11
Country,Argentina,Brasil,Germany,Greece,Japan,England,USA,Singapore,Australia,Canada,France,India
Sales,"1,592","1,088","1,680","2,133","1,610","1,540","1,316","1,799","1,624",726,"2,277",714
Net Sales,563,397,753,923,579,570,428,709,621,236,966,221

In [17]:
data=data.T
data

      Country      Sales   Net Sales
0   Argentina   1,592             563
1      Brasil   1,088             397
2     Germany   1,680             753
3      Greece   2,133             923
4       Japan   1,610             579
5     England   1,540             570
6         USA   1,316             428
7   Singapore   1,799             709
8   Australia   1,624             621
9      Canada     726             236
10     France   2,277             966
11      India     714             221

In [19]:
geo={'USA':['CHI','NVV'],'Russia':['MOW','LED'],'India':['Delhi','U.P']}

In [20]:
for i in geo:
    print(i)

USA
Russia
India

In [21]:
for i in geo:
    print(geo[i])

['CHI', 'NVV']
['MOW', 'LED']
['Delhi', 'U.P']

In [25]:
for i in geo:
    print(geo.get(i,"not fount"))

['CHI', 'NVV']
['MOW', 'LED']
['Delhi', 'U.P']

In [34]:
geo

{'USA': ['CHI', 'NVV'], 'Russia': ['MOW', 'LED'], 'India': ['Delhi', 'U.P']}

In [35]:
geo.update({"name":"abc"})

In [36]:
geo

{'USA': ['CHI', 'NVV'],
 'Russia': ['MOW', 'LED'],
 'India': ['Delhi', 'U.P'],
 'name': 'abc'}

In [37]:
geo.setdefault("id",12)

12

In [30]:
geo

{'USA': ['CHI', 'NVV'],
 'Russia': ['MOW', 'LED'],
 'India': ['Delhi', 'U.P'],
 'name': 'abc',
 'id': 12}

In [39]:
del geo['id']

In [40]:
geo

{'USA': ['CHI', 'NVV'],
 'Russia': ['MOW', 'LED'],
 'India': ['Delhi', 'U.P'],
 'name': 'abc'}

In [ ]:
#list

In [41]:
x=[1,2,3,4,5,6,5]

In [42]:
x.remove(2)#works on value

In [43]:
x

[1, 3, 4, 5, 6, 5]

In [44]:
x.remove(x[2])#index

In [45]:
x

[1, 3, 5, 6, 5]

In [46]:
x.pop(3)#work on index

6

In [47]:
x

[1, 3, 5, 5]

In [49]:
x.append(50)

In [50]:
x

[1, 3, 5, 5, 5, 50]

In [ ]:
#in set indexing is not  allow

In [37]:
x={1,2,3,4,5,6,5}

In [38]:
x.add(10)

In [39]:
x

{1, 2, 3, 4, 5, 6, 10}

In [40]:
x.remove(4)

In [41]:
x

{1, 2, 3, 5, 6, 10}

In [44]:
x={1, 2, 3, 5, 6, 10}
y={1,2,3}
print(y.intersection(x))
print(y.union(x))
print(y.issubset(x))

{1, 2, 3}
{1, 2, 3, 5, 6, 10}
True

In [25]:
geo={'USA':['CHI','NVV'],'Russia':['MOW','LED'],'India':['Delhi','U.P']}

In [26]:
for i in geo:
    print(geo[i])

['CHI', 'NVV']
['MOW', 'LED']
['Delhi', 'U.P']

In [33]:
# for i in geo:
print(geo['USA'][0])

CHI